import React from 'react'

const About = () => {
  return (
    <div>
      <h1>Это приложения создано в качестве обучающего примера</h1>
      <h2>Было изучено:</h2>
      <ul>
        <li>Основные концепции</li>
        <li>Управление состоянием + жизненный цикл компонента</li>
        <li>Бибилиотека UI компонентов</li>
        <li>Постраничная навигация</li>
        <li>Сортировка/поиск</li>
        <li>Работа с сервером</li>
        <li>Модальные окна</li>
        <li>Постраничный вывод (пагинация)</li>
        <li>Бесконечная лента</li>
        <li>Кастомные хуки, переиспользуемый функционал</li>
      </ul>
    </div>
  )
}

export default About
